#-*- encoding: utf-8 -*-
'''
Created on 2011-11-29

@author: Leo
'''
import re,sys
import string

_provinces=[u'山东',u'江苏',u'安徽',u'浙江',u'福建',u'上海',u'广东',u'广西',u'海南',u'湖北',u'湖南',u'河南',\
            u'江西',u'北京',u'天津',u'河北',u'山西',u'内蒙古',u'宁夏',u'新疆',u'青海',u'陕西',u'甘肃',u'四川',\
            u'云南',u'贵州',u'西藏',u'重庆',u'辽宁',u'吉林',u'黑龙江',u'台湾',u'香港',u'澳门']

_citys={1:u'北京',2:u'上海',3:u'广州',4:u'深圳',5:u'天津',6:u'重庆',7:u'南京',8:u'杭州',9:u'成都',10:u'武汉',\
        11:u'丹东',12:u'乌鲁木齐',13:u'九江',14:u'兰州',15:u'包头',16:u'北海',17:u'南京',18:u'南充',19:u'南宁',\
        20:u'南昌',21:u'厦门',22:u'合肥',23:u'吉林',24:u'呼和浩特',25:u'哈尔滨',26:u'唐山',27:u'大连',28:u'太原',\
        29:u'宁波',30:u'安庆',31:u'宜昌',32:u'岳阳',33:u'常德',34:u'平顶山',35:u'徐州',36:u'惠州',37:u'扬州',\
        38:u'无锡',39:u'昆明',40:u'桂林',41:u'武汉',42:u'沈阳',43:u'泉州',44:u'泸州',45:u'洛阳',46:u'济南',\
        47:u'济宁',48:u'温州',49:u'湛江',50:u'烟台',51:u'牡丹江',52:u'石家庄 ',53:u'福州',54:u'秦皇岛 ',55:u'蚌埠',\
        56:u'襄阳',57:u'西宁',58:u'西安',59:u'贵阳',60:u'赣州',61:u'遵义',62:u'郑州',63:u'金华',64:u'银川',\
        65:u'锦州',66:u'长春',67:u'长沙',68:u'青岛',69:u'韶关'}


_districts=[(1,u'朝阳',1),(2,u'海淀',1),(3,u'东城',1),(4,u'西城',1),(5,u'崇文',1),(6,u'宣武',1),(7,u'丰台',1),\
    (8,u'通州',1),(9,u'石景山',1),(10,u'房山',1),(11,u'昌平',1),(12,u'大兴',1),(13,u'顺义',1),\
    (14,u'密云',1),(15,u'怀柔',1),(16,u'延庆',1),(17,u'平谷',1),(18,u'门头沟',1),(19,u'黄浦',2),\
    (20,u'卢湾',2),(21,u'静安',2),(22,u'徐汇',2),(23,u'浦东',2),(24,u'长宁',2),(25,u'虹口',2),\
    (26,u'杨浦',2),(27,u'普陀',2),(28,u'闸北',2),(29,u'闵行',2),(30,u'宝山',2),(31,u'嘉定',2),\
    (32,u'青浦',2),(33,u'奉贤',2),(34,u'南汇',2),(35,u'崇明',2),(36,u'金山',2),(37,u'松江',2),\
    (38,u'天河',3),(39,u'海珠',3),(40,u'越秀',3),(41,u'白云',3),(42,u'荔湾',3),(43,u'番禺',3),\
    (44,u'黄埔',3),(45,u'花都',3),(46,u'增城',3),(47,u'萝岗',3),(48,u'罗湖',4),(49,u'布吉',4),\
    (50,u'福田',4),(51,u'南山',4),(52,u'盐田',4),(53,u'宝安',4),(54,u'龙岗',4),(55,u'南开',5),\
    (56,u'河西',5),(57,u'河东',5),(58,u'和平',5),(59,u'河北',5),(60,u'红桥',5),(61,u'塘沽',5),\
    (62,u'东丽',5),(63,u'西青',5),(64,u'北辰',5),(65,u'津南',5)]

def extract_province(s):
    for p in _provinces:
        if s.find(p)>0:
            return p
    return None

def extract_city(s):
    s=s.replace(' ','')
    if type(s) is str:
        s=unicode(s.decode('utf-8'))
    for k,c in _citys.items():
        if s.find(c)>-1:
            return k,c
    else:
        for p in _provinces:
            if s.find(p)>-1:
                s=s.replace(p,'')
                if len(s)>4:
                    continue
                else:
                    break
        else:
            for d in _districts:
                if s.find(d[1])>-1:
                    s=s.replace(d[1],'')
                    if len(s)>4:
                        continue
                    else:
                        break
    return 0,s

def extract_district(s):
    s=s.replace(' ','').replace('\n','').replace('\t','')
    if type(s) is str:
        s=unicode(s.decode('utf-8'))
    for d in _districts:
        if s.find(d[1])>-1:
            return d
    else:
        for k,c in _citys.items():
            if s.find(c)>-1:
                s=s.replace(c,'')
                if len(s)>3:
                    continue
                else:
                    break
                return k,c

    return 0,s,0

if __name__=='__main__':
    s='第三个'
    unicode(s.decode('utf-8'))
    print extract_district('上海d海'.decode('utf8'))
